<template>
  <div class="faq-page">
    <div class="faq-page__container">
      <div class="faq-page__content">
        <div class="faq-page__title">
          <h3>Вопросы и ответы</h3>
        </div>
        <div class="faq-page__group">
          <FAQItem
              v-for="(item, index) in faqItems"
              :key="index"
              :question="item.question"
              :content="item.content"
          />
        </div>
      </div>
    </div>
  </div>
</template>
<script setup lang="ts">
import FAQItem from "~/components/content/home/FAQ/item.vue";

const faqItems = [
  {
    question: 'Какие формы может принимать домашнее насилие?',
    content: 'Домашнее насилие может принимать множество форм, включая физическое, эмоциональное, сексуальное и экономическое насилие. Это могут быть побои, угрозы, унижения, изоляция от друзей и семьи, контроль финансов и другие способы подавления и манипуляции.'
  },
  {
    question: 'Что делать в случае бытового насилия?',
    content: 'Если вы подверглись бытовому насилию, то не стоит об этом молчать. В случаях бытового насилия их жертвам или свидетелям необходимо обратиться с заявлением в органы внутренних дел. В целях защиты потерпевших от бытового насилия органы внутренних дел наделены правом применять меры индивидуальной профилактики бытового насилия, а также направить их в Специализированный кризисный центр. Подробные пошаговые инструкции вы можете прочитать, перелистнув нашу подборку Подвергнувшись насилию, вы всегда можете обратиться к нам по телефону доверия'
  },
  {
    question: 'Что делать, если абьюзером оказался я?',
    content: 'Первый шаг на пути к решению проблемы — это обнаружение этой самой проблемы. До тех пор, пока вас все устраивает, глупо и безосновательно ждать каких-либо перемен в жизни. ⠀Вы — тот, кто вы есть, и на этом этапе очень важно помнить: если вы совершаете что-то плохое, это еще не делает вас плохим человеком, лишь тем, кто плохо поступает. Ваши поступки не есть вы, и то, что вы осознаете природу своих действий, поможет вам справиться. ⠀Начните слушать своих жертв, не возражая и не оправдываясь. Постарайтесь понять, что чувствуют те, кому вы причиняете боль. Не воспринимайте слова пострадавших как попытку напасть на вас, примите их и поймите. Вас не обвиняют, с вами делятся — с этой точки зрения слышать о своих «подвигах» куда легче.⠀Последний шаг на пути к выходу из роли абьюзера — получение прощения. Конечно, было бы здорово, если ваши жертвы вас простят — и вам нужно будет выслушать их (см. предыдущий пункт) и извиниться. Но будьте готовы к тому, что далеко не каждый пострадавший от ваших действий человек будет готов вас простить. И это нормально.⠀Если вам требуется помощь в данном вопросы, вы знаете, куда обратиться'
  },
  {
    question: 'Как понять, что мне нужна помощь?',
    content: 'Самому часто сложно самостоятельно заметить, что в отношениях что-то не то. Бьет — значит любит. И если у человека с детства была лишь подобная картина мира и лишь такая ущербная модель семьи, то гарантия, что свою семью он создаст именно по этому сценарию, почти стопроцентная. ⠀Часто абьюз имеет нарастающий характер. То есть начинаться может все с пары оскорблений, а развиться в систематические жесточайшие побои. Разумеется, когда речь уже заходит о физическом воздействии, это самый последний и самый опасный сигнал для вас, как для жертвы. ⠀Важная характерная черта абьюза — это его систематическое проявление агрессором и четкая структура протекания всего цикла. Если замечаете признаки абьюза — мы поможем, важно лишь только обратиться'
  },
  {
    question: 'Как с нами связаться?',
    content: 'Связаться с нами можно через наш сайт, по телефону доверия, или через социальные сети. Мы готовы выслушать вас и помочь вам в любое время.'
  },
];
</script>