<template>
  <section class="services" id="services">
    <div class="services__container">
      <div class="services__content">
        <div class="services__content-title">
          <h2>Услуги центра</h2>
        </div>
        <div class="services__grid">
          <ServiceItem
              v-for="(item, index) in serviceItems"
              :key="index"
              :title="item.title"
              :items="[{
                label: item.label,
                content: item.content
              }]"
          />
        </div>
      </div>
    </div>
  </section>
</template>

<script setup lang="ts">
import ServiceItem from "~/components/content/home/Services/item.vue";

const serviceItems = [
  {
    title: 'Социально-бытовые',
    label: 'Подробнее',
    content: 'Эти услуги направлены на помощь людям в решении бытовых проблем, таких как жилищные вопросы, питание, одежда, бытовая техника и уборка. Например, помощь в организации домашнего хозяйства для пожилых или инвалидов, предоставление продуктов питания и одежды нуждающимся.',
  },
  {
    title: 'Социально-медицинские',
    label: 'Подробнее',
    content: 'Эти услуги связаны с оказанием помощи в области здравоохранения, такой как медицинская помощь, реабилитация, уход за больными и инвалидами. Это может включать медицинские консультации, профилактические мероприятия, поддержку при психических и физических заболеваниях и т.д.',
  },
  {
    title: 'Социально-психологические',
    label: 'Подробнее',
    content: 'Эти услуги направлены на поддержку психологического благополучия и эмоционального здоровья. Они могут включать в себя психологическую консультацию, психотерапию, групповую терапию, поддержку в кризисных ситуациях и т.д.',
  },
  {
    title: 'Социально-педагогические',
    label: 'Подробнее',
    content: 'Эти услуги ориентированы на помощь в образовании, воспитании и развитии личности. Включают в себя образовательную поддержку, помощь в адаптации к учебе, воспитательную работу с детьми и подростками, помощь в развитии навыков и т.д.',
  },
  {
    title: 'Социально-трудовые',
    label: 'Подробнее',
    content: 'Эти услуги направлены на интеграцию людей в сферу труда и занятости. Включают в себя помощь в поиске работы, профессиональную ориентацию, поддержку в трудовых конфликтах, развитие навыков для рынка труда и т.д.',
  },
  {
    title: 'Социально-культурные',
    label: 'Подробнее',
    content: 'Эти услуги ориентированы на поддержку культурной активности, самовыражения и социальной интеграции через культурные события и мероприятия. Включают в себя доступ к культурным мероприятиям, художественным и культурным программам, поддержку в общественной деятельности и т.д.',
  },
  {
    title: 'Социально-экономические',
    label: 'Подробнее',
    content: 'Эти услуги направлены на поддержку экономического благополучия и самостоятельности. Включают в себя консультации по финансовому планированию, помощь в получении социальных выплат, поддержку в трудностях с жилищными или финансовыми вопросами и т.д.',
  },
  {
    title: 'Социально-правовые',
    label: 'Подробнее',
    content: 'Эти услуги оказываются с целью защиты прав и интересов людей. Включают в себя правовую консультацию, помощь в решении правовых вопросов, защиту прав в суде, поддержку по вопросам законодательства в области социальной защиты и т.д.',
  },
];
</script>